In [21]:
import pandas as pd
import numpy as np

In [22]:
data = {
    "Column1":[1,2,3,4,5],
    "Column2":[10,20,13,20,25],
    "Column3":["abc","bca","ade","cba","dea"]
}

df = pd.DataFrame(data)
df

   Column1  Column2 Column3
0        1       10     abc
1        2       20     bca
2        3       13     ade
3        4       20     cba
4        5       25     dea

In [23]:
df["Column2"].unique

<bound method Series.unique of 0    10
1    20
2    13
3    20
4    25
Name: Column2, dtype: int64>

In [24]:
df["Column2"].nunique()

4

In [25]:
df["Column2"].value_counts()

20    2
10    1
13    1
25    1
Name: Column2, dtype: int64

In [26]:
df["Column1"]*2

0     2
1     4
2     6
3     8
4    10
Name: Column1, dtype: int64

In [27]:
def kareal(x):
    return x*x
kareal2 = lambda x:x*x
kareal(df["Column1"])

0     1
1     4
2     9
3    16
4    25
Name: Column1, dtype: int64

In [28]:
df["Column1"].apply(kareal)

0     1
1     4
2     9
3    16
4    25
Name: Column1, dtype: int64

In [29]:
df["Column1"].apply(kareal2)

0     1
1     4
2     9
3    16
4    25
Name: Column1, dtype: int64

In [30]:
df["Column1"].apply(lambda x:x*x)

0     1
1     4
2     9
3    16
4    25
Name: Column1, dtype: int64

In [31]:
df["Column3"].apply(len)

0    3
1    3
2    3
3    3
4    3
Name: Column3, dtype: int64

In [35]:
df["Column4"] = df["Column3"].apply(len)
df

   Column1  Column2 Column3  Column4
0        1       10     abc        3
1        2       20     bca        3
2        3       13     ade        3
3        4       20     cba        3
4        5       25     dea        3

In [36]:
df.columns

Index(['Column1', 'Column2', 'Column3', 'Column4'], dtype='object')

In [37]:
len(df.columns)

4

In [39]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [40]:
len(df.index)

5

In [42]:
df.info

<bound method DataFrame.info of    Column1  Column2 Column3  Column4
0        1       10     abc        3
1        2       20     bca        3
2        3       13     ade        3
3        4       20     cba        3
4        5       25     dea        3>

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  5 non-null      int64
 1   Column2  5 non-null      int64
 2   Column3  5 non-null      object
 3   Column4  5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 288.0+ bytes

In [45]:
df.sort_values("Column2")

   Column1  Column2 Column3  Column4
0        1       10     abc        3
2        3       13     ade        3
1        2       20     bca        3
3        4       20     cba        3
4        5       25     dea        3

In [46]:
df.sort_values("Column3")

   Column1  Column2 Column3  Column4
0        1       10     abc        3
2        3       13     ade        3
1        2       20     bca        3
3        4       20     cba        3
4        5       25     dea        3

In [47]:
df.sort_values("Column3",ascending=False)

   Column1  Column2 Column3  Column4
4        5       25     dea        3
3        4       20     cba        3
1        2       20     bca        3
2        3       13     ade        3
0        1       10     abc        3